app/Http/Livewire/Tabler/Stock/Achat.php

select * from "achats" where "achats"."id" = '3' and "achats"."deleted_at" is null limit 1
select * from "achat_factures" where "achat_id" = '3'
---
    public function render()
    {
        $achat = ModelsAchat::find($this->achat_id);
        $total = 0;
        foreach ($achat->articles as $key => $achat_row) {
            $total += $achat_row->quantity * $achat_row->price;
        }

        return view('livewire.tabler.stock.achat',[
            'achat' => $achat,
            'articles' => $this->getArticles(),
            'total' => $total,
            'factures' => AchatFacture::where('achat_id', $this->achat_id)->get(),

select * from "articles" where "articles"."deleted_at" is null limit 7 offset 0
select count(*) as aggregate from "articles" where "articles"."deleted_at" is null
---
    public function getArticles()
    {
        if ($this->search) {
            return Article::where('designation', 'LIKE', "%{$this->search}%")
            ->orWhere('reference', 'LIKE', "%{$this->search}%")
            ->paginate(7);
        } else {
            return Article::paginate(7);

select * from "articles" where "articles"."id" = '1' and "articles"."deleted_at" is null limit 1
---
    public function addArticle($article_id=null)
    {
        if ($article_id) {
            $article = Article::find($article_id);

select * from "achat_articles" where "achat_articles"."id" = '1' and "achat_articles"."deleted_at" is null limit 1
---
    public function editAchatRow($achat_row_id)
    {
        $this->article_form = 2;
        $this->achat_row_id = $achat_row_id;
        $achat = AchatArticle::find($achat_row_id);