app/Http/Livewire/Tabler/Stock/Achats.php

    public function render()
    {
        return view('livewire.tabler.stock.achats',[
            'achats' => Achat::all(),
        ])->extends('app.layout')->section('content');
---
select * from "achats" where "achats"."deleted_at" is null

    public function addAchat()
    {
        $this->validate($this->rules);
        if ($this->tva_check) {
            $tva = 0.18;
        }else{
            $tva = 0;
        }

        $achat = Achat::create([
            'name' => $this->name,
            'date' => $this->date ?? date('Y-m-d'),
            'tva' => $tva,
            'description' => $this->description,
        ]);
---
insert into "achats" ("name", "date", "description", "updated_at", "created_at") values ('sdfsdfsdf', 0, '', '2023-05-23 21:55:21', '2023-05-23 21:55:21')

    public function editAchat($achat_id)
    {
        $achat = Achat::find($achat_id);
---
select * from "achats" where "achats"."id" = '3' and "achats"."deleted_at" is null limit 1

    public function updateAchat()
    {
        $tva = 0;
        $achat = Achat::find($this->achat_id);

        if ($this->tva_check) {
            $tva = 0.18;
        } else {
            $tva = 0;
        }

        $achat->name = $this->name;
        $achat->date = $this->date;
        $achat->tva = $tva;
        $achat->description = $this->description;
        $achat->save();
        $this->reset('achat_id');

        if ($this->factures) {
            $dir = "stock/achats/$achat->id";

            foreach ($this->factures as $key => $facture) {
                $name = $facture->getClientOriginalName();
                $facture->storeAS("public/$dir", $name);

                $img = AchatFacture::firstOrCreate([
                    'achat_id' => $achat->id,
                    'name' => $name,
                    'folder' => "storage/$dir/$name",
                ]);
---
select * from "achats" where "achats"."id" = '3' and "achats"."deleted_at" is null limit 1
insert into "achat_factures" ("achat_id", "name", "folder", "updated_at", "created_at") values (3, 'DDSC Access Control.pdf', 'storage/stock/achats/3/DDSC Access Control.pdf', '2023-05-23 22:05:52', '2023-05-23 22:05:52')
select * from "achat_factures" where ("achat_id" = 3 and "name" = 'DDSC Access Control.pdf' and "folder" = 'storage/stock/achats/3/DDSC Access Control.pdf') limit 1