app/Http/Livewire/Tabler/Stock/Article.php

    public function mount($article_id)
    {
        $this->article = ModelsArticle::find($article_id);
---
select * from "articles" where "articles"."id" = '1' and "articles"."deleted_at" is null limit 1

    public function render()
    {
        return view('livewire.tabler.stock.article',[
            'article' => $this->article,
            'priorite' => MainController::getArticlePriotity(),
            'marques' => Brand::all(),
            'providers' => Provider::all(),
            'fichiers' => ArticleDoc::where('article_id', $this->article_id)->where('doc_type','!=',0)->get() ,
---
select * from "brands" where "brands"."deleted_at" is null
select * from "providers" where "providers"."deleted_at" is null
select * from "article_docs" where "article_id" = '1' and "doc_type" != 0 and "article_docs"."deleted_at" is null

    public function editArticle($article_id)
    {
        $this->form = 2;
        $article = ModelsArticle::find($this->article_id);
---
select * from "articles" where "articles"."id" = '1' and "articles"."deleted_at" is null limit 1

    public function updateArticle()
    {
        $article = ModelsArticle::find($this->article_id);
---
select * from "articles" where "articles"."id" = '1' and "articles"."deleted_at" is null limit 1