app/Http/Livewire/Tabler/Stock/ArticleAdd.php

select * from "brands" where "brands"."deleted_at" is null
select * from "providers" where "providers"."deleted_at" is null
---
    public function render()
    {
        return view('livewire.tabler.stock.article-add',[
            'priorite' => MainController::getArticlePriotity(),
            'marques' => Brand::all(),
            'providers' => Provider::all(),

insert into "articles" ("designation", "description", "priority", "reference", "quantity", "price", "brand_id", "provider_id", "updated_at", "created_at") values ('Sdfggg', '', 1, 'dsfgsdfgff', 0, 0, '', '', '2023-05-23 21:44:19', '2023-05-23 21:44:19')
select * from "articles" where ("designation" = 'Sdfggg' and "description" = '' and "priority" = 1 and "reference" = 'dsfgsdfgff' and "quantity" = 0 and "price" = 0 and "brand_id" is null and "provider_id" is null) and "articles"."deleted_at" is null limit 1
---
    public function articleAdd()
    {
        $this->validate($this->rules);

        $article = Article::firstOrCreate([
            'designation' => ucfirst($this->designation),
            'description' => ucfirst($this->description),
            'priority' => $this->priority_id,
            'reference' => $this->reference,
            'quantity' => $this->quantity,
            'price' => $this->price,
            'brand_id' => $this->brand_id,
            'provider_id' => $this->provider_id,
        ]);