app/Http/Livewire/Tabler/Stock/Articles.php

select * from "brands" where "brands"."deleted_at" is null
select * from "providers" where "providers"."deleted_at" is null
---
    public function render()
    {
        return view('livewire.tabler.stock.articles',[
            'articles' => $this->getArticles(),
            'priorite' => MainController::getArticlePriotity(),
            'marques' => Brand::all(),
            'providers' => Provider::all(),

select * from "articles" where "articles"."deleted_at" is null order by "id" desc limit 12 offset 0
select count(*) as aggregate from "articles" where "articles"."deleted_at" is null
---
    public function getArticles()
    {
        if ($this->search) {
            return Article::where('designation', 'LIKE', "%{$this->search}%")
                ->orWhere('reference', 'LIKE', "%{$this->search}%")
                ->paginate(10);
        } else {
            return Article::orderBy('id', 'DESC')-> paginate(12);

select * from "articles" where "articles"."deleted_at" is null order by "id" desc limit 10 offset 0
---
    public function articleAdd()
    {
        $article = Article::firstOrCreate([
            'designation' => $this->designation,
            'description' => $this->description,
            'priority' => $this->priority,
            'reference' => $this->reference,
            'quantity' => $this->quantity,
            'price' => $this->price,
            'brand_id' => $this->brand_id,
            'provider_id' => $this->provider_id,
        ]);

select * from "articles" where "articles"."id" = '4' and "articles"."deleted_at" is null limit 1
---
    public function editArticle($article_id)
    {
        $this->form = 2;
        $article = Article::find($article_id);

select * from "articles" where "articles"."id" = '4' and "articles"."deleted_at" is null limit 1
insert into "article_docs" ("article_id", "name", "folder", "doc_type", "updated_at", "created_at") values (4, 'MAD-464-I.jpg', 'storage/stock/articles/4//MAD-464-I.jpg', 'image', '2023-05-24 00:52:59', '2023-05-24 00:52:59')
select * from "article_docs" where ("article_id" = 4 and "name" = 'MAD-464-I.jpg' and "folder" = 'storage/stock/articles/4//MAD-464-I.jpg' and "doc_type" = 'image') and "article_docs"."deleted_at" is null limit 1
---
    public function updateArticle()
    {
        $article = Article::find($this->article_id);
        $article->designation = $this->designation;
        $article->description = $this->description;
        $article->priority = $this->priority;
        $article->reference = $this->reference;
        $article->quantity = $this->quantity;
        $article->price = $this->price;
        $article->brand_id = $this->brand_id;
        $article->provider_id = $this->provider_id;

        $article->save();
        $this->form = 0;
        $this->article_id = 0;

        if ($this->photos) {
            $dir = "stock/articles/$article->id/";
            foreach ($this->photos as $key => $photo) {
                $name = $photo->getClientOriginalName();
                $photo->storeAS("public/$dir", $name);

                ArticleDoc::firstOrCreate([
                    'article_id' => $article->id,
                    'name' => $name,
                    'folder' => "storage/$dir/$name",
                    'doc_type' => 'image'
                ]);