app/Http/Livewire/Pages/Personne.php

select * from "personnes" where "personnes"."id" = '1' and "personnes"."deleted_at" is null limit 1
---
    public function mount($id)
    {
        $this->person = ModelsPersonne::find($id);