app/Http/Livewire/Cv/Experiences.php

    public function render()
    {
        return view('livewire.cv.experiences',[
            'experiences' => Experience::where('personne_id', $this->person_id)->get()
        ]);
---
select * from "experiences" where "personne_id" = 1 and "experiences"."deleted_at" is null