app/Http/Livewire/Cv/Interets.php

select * from "interets" where "personne_id" = 1 and "interets"."deleted_at" is null
---
    public function render()
    {
        return view('livewire.cv.interets',[
            'interets' => Interet::where('personne_id',$this->person_id)->get()
        ]);