app/Http/Livewire/Cv/Langues.php

    public function render()
    {
        return view('livewire.cv.langues',[
            'langues' => Langue::where('personne_id', $this->person_id)->get()
        ])->extends('app.layout')->section('content');
---
select * from "langues" where "personne_id" = 1 and "langues"."deleted_at" is null