app/Http/Livewire/Cv/Profile.php

select * from "personnes" where "personnes"."id" = 1 and "personnes"."deleted_at" is null limit 1
---
    public function render()
    {
        return view('livewire.cv.profile',[
            'person' => Personne::find($this->person_id),
        ]);

select * from "personnes" where "personnes"."id" = 1 and "personnes"."deleted_at" is null limit 1
---
    public function edit()
    {
        $personne = Personne::find($this->person_id);

select * from "personnes" where "personnes"."id" = 1 and "personnes"."deleted_at" is null limit 1
---
    public function update()
    {
        $personne = Personne::find($this->person_id);