app/Http/Livewire/Tabler/Task/TaskProjetList.php

    public function getTasks()
    {
        if ($this->task_toggle) {
            return Task::where('projet_id', $this->projet_id)->orderBy('priority_id', 'DESC')->where('status_id', [1, 2, 3])->paginate(7);
---
select * from "tasks" where "projet_id" = 1 and "status_id" = 1 and "tasks"."deleted_at" is null order by "priority_id" desc limit 7 offset 0
select count(*) as aggregate from "tasks" where "projet_id" = 1 and "status_id" = 1 and "tasks"."deleted_at" is null