app/Http/Livewire/Tabler/Task/Task.php

select * from "tasks" where "tasks"."id" = '3' and "tasks"."deleted_at" is null limit 1
---
    public function mount($task_id)
    {
        $this->task_id = $task_id;
        $this->task = ModelsTask::find($task_id);