app/Http/Livewire/Tabler/Erp/Clients.php

    public function getClients()
    {
        if ($this->search) {
            return Client::where('name', 'LIKE', "%{$this->search}%")->paginate(20);
        } else {
            return Client::paginate(20);
---
select * from "clients" where "clients"."deleted_at" is null limit 20 offset 0
select count(*) as aggregate from "clients" where "clients"."deleted_at" is null