app/Http/Livewire/Tabler/Erp/Client.php

select * from "clients" where "clients"."id" = '1' and "clients"."deleted_at" is null limit 1
---
    public function mount($client_id)
    {
        $this->client_id = $client_id;
        $this->client = ModelsClient::find($client_id);

select * from "projets" where "client_id" = '1' and "projets"."deleted_at" is null limit 20 offset 0
select count(*) as aggregate from "projets" where "client_id" = '1' and "projets"."deleted_at" is null
---
    public function getProjets()
    {
        if ($this->search) {
            return Projet::where('name', 'LIKE', "%{$this->search}%")->paginate(20);
        } else {
            return Projet::where('client_id', $this->client_id)->paginate(20);