app/Http/Livewire/Tabler/Erp/ContactList.php

    public function mount($projet_id)
    {
        $this->projet_id = $projet_id;
        $this->projet = Projet::find($projet_id);
---
select * from "projets" where "projets"."id" = 1 and "projets"."deleted_at" is null limit 1

    public function render()
    {
        $c = [];
        $list  = ProjetContact::where('projet_id', $this->projet_id)->get();

        foreach ($list as $item) {
            $user = Contact::find($item->contact_id);
---
select * from "projet_contacts" where "projet_id" = 1 and "projet_contacts"."deleted_at" is null
select * from "contacts" where "contacts"."id" = 1 and "contacts"."deleted_at" is null limit 1