app/Http/Livewire/Tabler/Erp/ContactList.php

    public function add_contact()
    {
        $this->validate($this->rules);
        Contact::create([
            'projet_id' => $this->projet_id,
            'firstname' => $this->firstname,
            'lastname' => $this->lastname,
            'description' => $this->description,
        ]);
---
select * from "contacts" where "contacts"."deleted_at" is null limit 10 offset 0