app/Http/Livewire/Tabler/Erp/DevisAdd.php

select * from "projets" where "projets"."id" = 1 and "projets"."deleted_at" is null limit 1
---
    public function mount($projet_id)
    {
        $this->projet_id = $projet_id;
        $this->projet = Projet::find($projet_id);