app/Http/Livewire/Tabler/Erp/DevisListCard.php

select * from "projets" where "projets"."id" = 1 and "projets"."deleted_at" is null limit 1
---
    public function mount($projet_id)
    {
        $this->projet_id = $projet_id;
        $this->projet = Projet::find($projet_id);

select * from "invoices" where "projet_id" = 1 and "invoices"."deleted_at" is null limit 10 offset 0
select count(*) as aggregate from "invoices" where "projet_id" = 1 and "invoices"."deleted_at" is null
---
    public function getDevis()
    {
        if ($this->search) {
            return Invoice::where('description', 'LIKE', "%{$this->search}%") ->paginate(10);
        } else {
            return Invoice::where('projet_id', $this->projet_id)->paginate(10);