app/Http/Livewire/Tabler/Erp/Projet.php

    public function mount($projet_id)
    {
        $this->projet_id = $projet_id;
        $this->projet = ModelsProjet::find($projet_id);
---
select * from "projets" where "projets"."id" = '1' and "projets"."deleted_at" is null limit 1