app/Http/Controllers/MainController.php

select * from "achats" where "achats"."id" = 1 and "achats"."deleted_at" is null limit 1
---
    public static function total_Achat($id){
        $achat = Achat::find($id);