app/Http/Livewire/Tabler/Func/Planning.php

    public function render()
    {
        $plannings = array(
            (object) array('dayName' => 'lundi', 'day'=> $this->date->startOfWeek()->day,
                'tasks'=> Task::whereDate('debut', '>=', $this->date->startOfWeek())->orWhereDate('fin', '<=', $this->date->startOfWeek())->get() ),
            (object) array('dayName' => 'mardi', 'day'=> $this->date->startOfWeek()->addDays(1)->day,
                'tasks'=> Task::whereDate('debut', '>=', $this->date->startOfWeek()->addDays(1))->orWhereDate('fin', '<=', $this->date->endOfWeek())->get() ),
            (object) array('dayName' => 'mercredi', 'day'=> $this->date->startOfWeek()->addDays(2)->day,
                'tasks'=> Task::whereDate('debut', '>=', $this->date->startOfWeek()->addDays(2))->orWhereDate('fin', '<=', $this->date->endOfWeek()->subDays(2))->get() ),
            (object) array('dayName' => 'jeudi', 'day'=> $this->date->startOfWeek()->addDays(3)->day,
                'tasks'=> Task::whereDate('debut', '>=', $this->date->startOfWeek()->addDays(3))->orWhereDate('fin', '<=', $this->date->endOfWeek()->subDays(3))->get() ),
            (object) array('dayName' => 'vendredi', 'day'=> $this->date->startOfWeek()->addDays(4)->day,
                'tasks'=> Task::whereDate('debut', '>=', $this->date->startOfWeek()->addDays(4))->orWhereDate('fin', '<=', $this->date->endOfWeek()->subDays(4))->get() ),
            (object) array('dayName' => 'samedi', 'day'=> $this->date->startOfWeek()->addDays(5)->day,
                'tasks'=> Task::whereDate('debut', '>=', $this->date->startOfWeek()->addDays(5))->orWhereDate('fin', '<=', $this->date->endOfWeek()->subDays(5))->get() ),
            (object) array('dayName' => 'dimanche', 'day'=> $this->date->startOfWeek()->addDays(6)->day,
                'tasks'=> Task::whereDate('debut', '>=', $this->date->startOfWeek()->addDays(6))->orWhereDate('fin', '<=', $this->date->endOfWeek()->subDays(6))->get() ),
        );
---
select * from "tasks" where (strftime('%Y-%m-%d', "debut") >= cast('2023-05-22' as text) or strftime('%Y-%m-%d', "fin") <= cast('2023-05-22' as text)) and "tasks"."deleted_at" is null
select * from "tasks" where (strftime('%Y-%m-%d', "debut") >= cast('2023-05-23' as text) or strftime('%Y-%m-%d', "fin") <= cast('2023-05-28' as text)) and "tasks"."deleted_at" is null
select * from "tasks" where (strftime('%Y-%m-%d', "debut") >= cast('2023-05-24' as text) or strftime('%Y-%m-%d', "fin") <= cast('2023-05-26' as text)) and "tasks"."deleted_at" is null
select * from "tasks" where (strftime('%Y-%m-%d', "debut") >= cast('2023-05-25' as text) or strftime('%Y-%m-%d', "fin") <= cast('2023-05-25' as text)) and "tasks"."deleted_at" is null
select * from "tasks" where (strftime('%Y-%m-%d', "debut") >= cast('2023-05-26' as text) or strftime('%Y-%m-%d', "fin") <= cast('2023-05-24' as text)) and "tasks"."deleted_at" is null
select * from "tasks" where (strftime('%Y-%m-%d', "debut") >= cast('2023-05-27' as text) or strftime('%Y-%m-%d', "fin") <= cast('2023-05-23' as text)) and "tasks"."deleted_at" is null
select * from "tasks" where (strftime('%Y-%m-%d', "debut") >= cast('2023-05-28' as text) or strftime('%Y-%m-%d', "fin") <= cast('2023-05-22' as text)) and "tasks"."deleted_at" is null