app/Http/Livewire/Tabler/Index.php

select * from "users"
---
    public function render()
    {
        return view('livewire.tabler.index',[
            'users' => User::all(),
            'test' => $this->scrapper(),
            'taches' => $this->getTasks()
        ])->extends('app.layout')->section('content');