app/Http/Livewire/Tabler/Index.php

    public function mount()
    {
        array_push($this->cards,
        array(
            'route' => 'tabler.clients',
            'title' => 'Clients',
            'details' => 'Page des clients',
            'icon' => '<svg xmlns="http://www.w3.org/2000/svg" class="icon icon-tabler icon-tabler-users" width="24" height="24" viewBox="0 0 24 24" stroke-width="2" stroke="currentColor" fill="none" stroke-linecap="round" stroke-linejoin="round"> <path stroke="none" d="M0 0h24v24H0z" fill="none"></path> <path d="M9 7m-4 0a4 4 0 1 0 8 0a4 4 0 1 0 -8 0"></path> <path d="M3 21v-2a4 4 0 0 1 4 -4h4a4 4 0 0 1 4 4v2"></path> <path d="M16 3.13a4 4 0 0 1 0 7.75"></path> <path d="M21 21v-2a4 4 0 0 0 -3 -3.85"></path> </svg>',
            'count' => Client::all()->count(),
        ),
        array(
            'route' => null,
            'title' => 'Projets',
            'details' => 'Projets',
            'icon' => '<svg xmlns="http://www.w3.org/2000/svg" class="icon icon-tabler icon-tabler-briefcase" width="24" height="24" viewBox="0 0 24 24" stroke-width="2" stroke="currentColor" fill="none" stroke-linecap="round" stroke-linejoin="round"> <path stroke="none" d="M0 0h24v24H0z" fill="none"></path> <path d="M3 7m0 2a2 2 0 0 1 2 -2h14a2 2 0 0 1 2 2v9a2 2 0 0 1 -2 2h-14a2 2 0 0 1 -2 -2z"></path> <path d="M8 7v-2a2 2 0 0 1 2 -2h4a2 2 0 0 1 2 2v2"></path> <path d="M12 12l0 .01"></path> <path d="M3 13a20 20 0 0 0 18 0"></path> </svg>',
            'count' => Projet::all()->count(),
        ),
        array(
            'route' => 'tabler.tasks',
            'title' => 'Taches',
            'details' => 'Taches à traiter',
            'icon' => ' <svg xmlns="http://www.w3.org/2000/svg" class="icon icon-tabler icon-tabler-clipboard-list" width="24" height="24" viewBox="0 0 24 24" stroke-width="2" stroke="currentColor" fill="none" stroke-linecap="round" stroke-linejoin="round"> <path stroke="none" d="M0 0h24v24H0z" fill="none"></path> <path d="M9 5h-2a2 2 0 0 0 -2 2v12a2 2 0 0 0 2 2h10a2 2 0 0 0 2 -2v-12a2 2 0 0 0 -2 -2h-2"></path> <path d="M9 3m0 2a2 2 0 0 1 2 -2h2a2 2 0 0 1 2 2v0a2 2 0 0 1 -2 2h-2a2 2 0 0 1 -2 -2z"></path> <path d="M9 12l.01 0"></path> <path d="M13 12l2 0"></path> <path d="M9 16l.01 0"></path> <path d="M13 16l2 0"></path> </svg> ',
            'count' => Task::where('status_id', [1, 2, 3, 6])->count(),
        ),
---
select count(*) as aggregate from "tasks" where "status_id" = 1 and "tasks"."deleted_at" is null

    public function render()
    {
        return view('livewire.tabler.index',[
            'users' => User::all(),
            'test' => $this->scrapper(),
            'taches' => $this->getTasks(),
            'tachesPrioritaires' => Task::orderBy('priority_id', 'DESC')->where('status_id', 6)->paginate(7),
---
select * from "tasks" where "status_id" = 6 and "tasks"."deleted_at" is null order by "priority_id" desc limit 7 offset 0
select count(*) as aggregate from "tasks" where "status_id" = 6 and "tasks"."deleted_at" is null

    public function getTasks()
    {
        if ($this->task_toggle) {
            return Task::orderBy('priority_id', 'DESC')->where('status_id', [1, 2, 3, 6])->paginate(7);
---
select * from "tasks" where "status_id" = 1 and "tasks"."deleted_at" is null order by "priority_id" desc limit 7 offset 0
select count(*) as aggregate from "tasks" where "status_id" = 1 and "tasks"."deleted_at" is null